A. Однажды в автобусе

Однажды Адлет ехал домой на автобусе и обратил внимание, что номер на его билете не был счастливым. На каждом автобусном билете — шестизначное число. Счастливый билет — тот, в котором сумма первых трех цифр этого числа равна сумме трех последних.   
Например, число 201111 — счастливое, так как суммы первых (2 + 0 + 1 = 3) и последних (1 + 1 + 1 = 3) трех цифр одинаковы. 
Поскольку номер на билете не был счастливым, Адлет захотел найти следующее ближайшее счастливое число. 
Например, если номер билета —165901, то счастливым (в последовательности возрастания) будет билет 165903.
Учитывая текущий номер билета Адлета, найдите и выведите ближайший (из следующих за ним) счастливый номер.

Формат ввода
Первая строка содержит целое число number(100000≤number≤999999) - шестизначный номер билета.

Формат вывода
Для числа во входных данных найдите и выведите следующее счастливое число. Гарантируется что такое число существует.

Пример 1
Input:  165901
Output: 165903

Пример 2
Input:  100000
Output: 100001

С++:

#include <iostream>
#include <cmath>
using namespace std;

int searchBus(int start){
    int a = start, tmp1 = 0, tmp2 = 0;
    for(int i = 0; i < 3; i++) {
        tmp1 += a % 10;
        a /= 10;
    }
    for(int i = 0; i < 3; i++) {
        tmp2 += a % 10;
        a /= 10;
    }
    return ((tmp1 != tmp2) ? searchBus(start + 1) : start);
}

int main(int argc, const char * argv[]) {
    int a;
    cin >> a;
    cout << searchBus(a) << endl;
    return 0;
}